
<template>
  <div id="app">
    <el-table border
              :data="tableData"
              style="width: 100%"
              :span-method="(arg)=>arraySpanMethod(arg,tableData,['成本类别'])" 
              >
              <el-table-column min-width="144.00" label="成本类别" prop="成本类别" :formatter="numberFormatter"/>
              <el-table-column min-width="144.00" label="明细科目" prop="明细科目" :formatter="numberFormatter"/>
              <el-table-column min-width="115.20" label="目标值" prop="目标值" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2502" prop="2502" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2503" prop="2503" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2504" prop="2504" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="合计" prop="合计" :formatter="numberFormatter"/>
    </el-table>
  </div>
</template>

<script>

export default {
  data(){
    return {
      tableData:[{"2502":180979.296797252,"2503":284537.255851792,"2504":257731.693120988,"成本类别":"产量","明细科目":"半成品入库产品","目标值":null,"合计":723248.245770032},{"2502":121289,"2503":257882,"2504":311605,"成本类别":"产量","明细科目":"入库产量","目标值":null,"合计":690776},{"2502":null,"2503":null,"2504":null,"成本类别":"质量","明细科目":"质量损失总金额","目标值":null,"合计":null},{"2502":null,"2503":null,"2504":null,"成本类别":"质量","明细科目":"单套质量损失成本","目标值":null,"合计":null},{"2502":227552.7016,"2503":350724.4668,"2504":380515.1411,"成本类别":"工资","明细科目":"一线工资","目标值":null,"合计":958792.3095},{"2502":101602.75,"2503":127141.635,"2504":145683.682783883,"成本类别":"工资","明细科目":"管理工资","目标值":null,"合计":374428.067783883},{"2502":329155.4516,"2503":477866.1018,"2504":526198.823883883,"成本类别":"工资","明细科目":"工资总计","目标值":null,"合计":1333220.37728388},{"2502":1.87611985917932,"2503":1.36001918241676,"2504":1.2211458131288,"成本类别":"工资","明细科目":"单套工资成本(一线)","目标值":1,"合计":1.38799308241746},{"2502":0.837691381741131,"2503":0.493022525806377,"2504":0.467526781610959,"成本类别":"工资","明细科目":"单套工资成本(二线)","目标值":0.4,"合计":0.542039775243904},{"2502":2.71381124092045,"2503":1.85304170822314,"2504":1.68867259473976,"成本类别":"工资","明细科目":"单套工资成本","目标值":1.4,"合计":1.93003285766136},{"2502":5532,"2503":38610,"2504":52144,"成本类别":"电费","明细科目":"当月耗电（度）","目标值":null,"合计":96286},{"2502":7319.615,"2503":35441.3775,"2504":45214.1225,"成本类别":"电费","明细科目":"当月电费","目标值":null,"合计":87975.115},{"2502":1.32314081706435,"2503":0.917932595182595,"2504":0.867101152577478,"成本类别":"电费","明细科目":"电费单价","目标值":null,"合计":0.913685426749475},{"2502":0.0603485476836317,"2503":0.137432536974275,"2504":0.145100760578296,"成本类别":"电费","明细科目":"单套电费成本","目标值":0.1,"合计":0.127356936257195},{"2502":21.924981923355,"2503":6.67915047915048,"2504":5.97585532371893,"成本类别":"电费","明细科目":"耗电产出量","目标值":"9-15","合计":7.17421016554847},{"2502":545.125,"2503":632.4125,"2504":645.175,"成本类别":"生产制造成本","明细科目":"水费","目标值":null,"合计":1822.7125},{"2502":0.00449443065735557,"2503":0.0024523328499081,"2504":0.00207048988302498,"成本类别":"生产制造成本","明细科目":"单套水费成本","目标值":null,"合计":0.0026386447994719},{"2502":11362.75,"2503":16716.5,"2504":13896.5,"成本类别":"生产制造成本","明细科目":"油料","目标值":null,"合计":41975.75},{"2502":0.0936832688867086,"2503":0.064822283059694,"2504":0.0445965244460134,"成本类别":"生产制造成本","明细科目":"单套油料成本","目标值":null,"合计":0.0607660804660266},{"2502":10946.7225,"2503":15548.255,"2504":30337.3175,"成本类别":"生产制造成本","明细科目":"磨料","目标值":null,"合计":56832.295},{"2502":0.0902532175217868,"2503":0.0602921297337542,"2504":0.0973582500280804,"成本类别":"生产制造成本","明细科目":"单套磨料成本","目标值":null,"合计":0.0822731174794724},{"2502":59426,"2503":68530.05,"2504":61089.05,"成本类别":"生产制造成本","明细科目":"配件","目标值":null,"合计":189045.1},{"2502":0.489953746836069,"2503":0.265741889701491,"2504":0.196046436995555,"成本类别":"生产制造成本","明细科目":"单套配件成本","目标值":null,"合计":0.273670625499438},{"2502":12057.17,"2503":22682.11,"2504":5246.56,"成本类别":"生产制造成本","明细科目":"热处理","目标值":null,"合计":39985.84},{"2502":0.0994086025938049,"2503":0.0879553826944106,"2504":0.0168372137802667,"成本类别":"生产制造成本","明细科目":"单套热处理成本","目标值":null,"合计":0.0578853926598492},{"2502":null,"2503":null,"2504":null,"成本类别":"生产制造成本","明细科目":"外加工","目标值":null,"合计":0},{"2502":0,"2503":0,"2504":0,"成本类别":"生产制造成本","明细科目":"单套外加工成本","目标值":null,"合计":0},{"2502":2993.75,"2503":6510,"2504":4240,"成本类别":"生产制造成本","明细科目":"纸箱","目标值":null,"合计":13743.75},{"2502":0.0246827824452341,"2503":0.025244103892478,"2504":0.01360697036312,"成本类别":"生产制造成本","明细科目":"单套纸箱成本","目标值":null,"合计":0.0198961023544535},{"2502":1455.2,"2503":10069.11,"2504":10364.3825,"成本类别":"生产制造成本","明细科目":"运费","目标值":null,"合计":21888.6925},{"2502":0.0119977904014379,"2503":0.0390454161205513,"2504":0.0332612843182876,"成本类别":"生产制造成本","明细科目":"单套运费成本","目标值":null,"合计":0.0316871062399389},{"2502":16022.0264285714,"2503":14115.5914285714,"2504":56887.2514285714,"成本类别":"生产制造成本","明细科目":"零星支出","目标值":null,"合计":87024.8692857142},{"2502":0.132097934920491,"2503":0.0547366292667631,"2504":0.182562062317907,"成本类别":"生产制造成本","明细科目":"单套零星支出成本","目标值":null,"合计":0.125981315630124},{"2502":0.946571774262888,"2503":0.600290167319051,"2504":0.586339232132255,"成本类别":"生产制造成本","明细科目":"生产制造成本总计","目标值":0.4,"合计":0.654798385128774},{"2502":3.72073156286697,"2503":2.59076441251647,"2504":2.42011258745031,"成本类别":"变动成本合计","明细科目":"变动成本合计","目标值":1.9,"合计":2.71218817904733},{"2502":25025,"2503":25025,"2504":25025,"成本类别":"固定成本","明细科目":"房租","目标值":null,"合计":75075},{"2502":27685.4933333333,"2503":27685.4933333333,"2504":23732.8725,"成本类别":"固定成本","明细科目":"折旧","目标值":null,"合计":79103.8591666666},{"2502":null,"2503":null,"2504":null,"成本类别":"固定成本","明细科目":"待摊","目标值":null,"合计":0},{"2502":52710.4933333333,"2503":52710.4933333333,"2504":48757.8725,"成本类别":"固定成本","明细科目":"合计","目标值":null,"合计":154178.859166667},{"2502":0.434585933871442,"2503":0.20439772195552,"2504":0.156473331621765,"成本类别":"固定成本","明细科目":"单套成本合计","目标值":null,"合计":0.223196606666512},{"2502":4.15531749673841,"2503":2.79516213447199,"2504":2.57658591907208,"成本类别":"变动成本+固定成本","明细科目":"单套成本总计","目标值":null,"合计":2.93538478571384}],
    }
  },
  methods:{
    arraySpanMethod({ row, column, rowIndex },tableData,fields) {
      const visibleData = tableData
      if (fields.includes(column.property)) {
        const cellValue = row[column.property]
        const prevRow = visibleData[rowIndex - 1]
        let nextRow = visibleData[rowIndex + 1]
        if (prevRow && prevRow[column.property] === cellValue) {
          return { rowspan: 0, colspan: 0 }
        } else {
          let countRowspan = 1
          while (nextRow && nextRow[column.property] === cellValue) {
            nextRow = visibleData[++countRowspan + rowIndex]
          }
          if (countRowspan > 1) {
            return { rowspan: countRowspan, colspan: 1 }
          }
        }
      }

    },
    numberFormatter(row,column,cellValue) {
      return typeof cellValue === 'number' ? cellValue.toFixed(4) : cellValue
    }
  }
}
</script>

<style>

</style>

