
<template>
  <div id="app">
    <el-table border
              :data="tableData"
              style="width: 100%"
              :span-method="(arg)=>arraySpanMethod(arg,tableData,['成本类别'])" 
              >
              <el-table-column min-width="144.00" label="成本类别" prop="成本类别" :formatter="numberFormatter"/>
              <el-table-column min-width="144.00" label="明细科目" prop="明细科目" :formatter="numberFormatter"/>
              <el-table-column min-width="115.20" label="目标值" prop="目标值" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2302" prop="2302" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2303" prop="2303" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2304" prop="2304" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="2305" prop="2305" :formatter="numberFormatter"/>
              <el-table-column min-width="86.40" label="合计" prop="合计" :formatter="numberFormatter"/>
    </el-table>
  </div>
</template>

<script>

export default {
  data(){
    return {
      tableData:[{"2302":180979.296797252,"2303":284537.255851792,"2304":257731.693120988,"2305":306442.983057549,"成本类别":"产量","明细科目":"半成品入库产品","目标值":null,"合计":1029691.22882758},{"2302":121289,"2303":257882,"2304":311605,"2305":321801,"成本类别":"产量","明细科目":"入库产量","目标值":null,"合计":1012577},{"2302":null,"2303":null,"2304":null,"2305":null,"成本类别":"质量","明细科目":"质量损失总金额","目标值":null,"合计":null},{"2302":null,"2303":null,"2304":null,"2305":null,"成本类别":"质量","明细科目":"单套质量损失成本","目标值":null,"合计":null},{"2302":227552.7016,"2303":350724.4668,"2304":380515.1411,"2305":343325.1925,"成本类别":"工资","明细科目":"一线工资","目标值":null,"合计":1302117.502},{"2302":101602.75,"2303":127141.635,"2304":145683.682783883,"2305":130753.875535206,"成本类别":"工资","明细科目":"管理工资","目标值":null,"合计":505181.943319089},{"2302":329155.4516,"2303":477866.1018,"2304":526198.823883883,"2305":474079.068035206,"成本类别":"工资","明细科目":"工资总计","目标值":null,"合计":1807299.44531909},{"2302":1.87611985917932,"2303":1.36001918241676,"2304":1.2211458131288,"2305":1.06688665510673,"成本类别":"工资","明细科目":"单套工资成本(一线)","目标值":1,"合计":1.2859441820227},{"2302":0.837691381741131,"2303":0.493022525806377,"2304":0.467526781610959,"2305":0.406319046663018,"成本类别":"工资","明细科目":"单套工资成本(二线)","目标值":0.4,"合计":0.498907187620387},{"2302":2.71381124092045,"2303":1.85304170822314,"2304":1.68867259473976,"2305":1.47320570176975,"成本类别":"工资","明细科目":"单套工资成本","目标值":1.4,"合计":1.78485136964309},{"2302":5532,"2303":38610,"2304":52144,"2305":54058,"成本类别":"电费","明细科目":"当月耗电（度）","目标值":null,"合计":150344},{"2302":7319.615,"2303":35441.3775,"2304":45214.1225,"2305":45990.6025,"成本类别":"电费","明细科目":"当月电费","目标值":null,"合计":133965.7175},{"2302":1.32314081706435,"2303":0.917932595182595,"2304":0.867101152577478,"2305":0.850764040475045,"成本类别":"电费","明细科目":"电费单价","目标值":null,"合计":0.891061282791465},{"2302":0.0603485476836317,"2303":0.137432536974275,"2304":0.145100760578296,"2305":0.142916282112237,"成本类别":"电费","明细科目":"单套电费成本","目标值":0.1,"合计":0.132301758286037},{"2302":21.924981923355,"2303":6.67915047915048,"2304":5.97585532371893,"2305":5.95288393947242,"成本类别":"电费","明细科目":"耗电产出量","目标值":"9-15","合计":6.73506757835364},{"2302":545.125,"2303":632.4125,"2304":645.175,"2305":758.625,"成本类别":"生产制造成本","明细科目":"水费","目标值":null,"合计":2581.3375},{"2302":0.00449443065735557,"2303":0.0024523328499081,"2304":0.00207048988302498,"2305":0.00235743518509887,"成本类别":"生产制造成本","明细科目":"单套水费成本","目标值":null,"合计":0.00254927526499219},{"2302":11362.75,"2303":16716.5,"2304":13896.5,"2305":9241.295,"成本类别":"生产制造成本","明细科目":"油料","目标值":null,"合计":51217.045},{"2302":0.0936832688867086,"2303":0.064822283059694,"2304":0.0445965244460134,"2305":0.0287174216363529,"成本类别":"生产制造成本","明细科目":"单套油料成本","目标值":null,"合计":0.0505808891570715},{"2302":10946.7225,"2303":15548.255,"2304":30337.3175,"2305":26827.7,"成本类别":"生产制造成本","明细科目":"磨料","目标值":null,"合计":83659.995},{"2302":0.0902532175217868,"2303":0.0602921297337542,"2304":0.0973582500280804,"2305":0.0833673605737708,"成本类别":"生产制造成本","明细科目":"单套磨料成本","目标值":null,"合计":0.0826208722892185},{"2302":59426,"2303":68530.05,"2304":61089.05,"2305":55283.9105,"成本类别":"生产制造成本","明细科目":"配件","目标值":null,"合计":244329.0105},{"2302":0.489953746836069,"2303":0.265741889701491,"2304":0.196046436995555,"2305":0.171795334694423,"成本类别":"生产制造成本","明细科目":"单套配件成本","目标值":null,"合计":0.241294252683993},{"2302":12057.17,"2303":22682.11,"2304":5246.56,"2305":11795.8,"成本类别":"生产制造成本","明细科目":"热处理","目标值":null,"合计":51781.64},{"2302":0.0994086025938049,"2303":0.0879553826944106,"2304":0.0168372137802667,"2305":0.0366555728540309,"成本类别":"生产制造成本","明细科目":"单套热处理成本","目标值":null,"合计":0.0511384714446408},{"2302":null,"2303":null,"2304":null,"2305":126,"成本类别":"生产制造成本","明细科目":"外加工","目标值":null,"合计":126},{"2302":0,"2303":0,"2304":0,"2305":0.000391546328320919,"成本类别":"生产制造成本","明细科目":"单套外加工成本","目标值":null,"合计":0.000124434981240933},{"2302":2993.75,"2303":6510,"2304":4240,"2305":7894,"成本类别":"生产制造成本","明细科目":"纸箱","目标值":null,"合计":21637.75},{"2302":0.0246827824452341,"2303":0.025244103892478,"2304":0.01360697036312,"2305":0.0245306882203598,"成本类别":"生产制造成本","明细科目":"单套纸箱成本","目标值":null,"合计":0.0213689921852857},{"2302":1455.2,"2303":10069.11,"2304":10364.3825,"2305":9130.9175,"成本类别":"生产制造成本","明细科目":"运费","目标值":null,"合计":31019.61},{"2302":0.0119977904014379,"2303":0.0390454161205513,"2304":0.0332612843182876,"2305":0.028374422391478,"成本类别":"生产制造成本","明细科目":"单套运费成本","目标值":null,"合计":0.0306343221305639},{"2302":16022.0264285714,"2303":14115.5914285714,"2304":56887.2514285714,"2305":13585.6114285714,"成本类别":"生产制造成本","明细科目":"零星支出","目标值":null,"合计":100610.480714286},{"2302":0.132097934920491,"2303":0.0547366292667631,"2304":0.182562062317907,"2305":0.0422174307369194,"成本类别":"生产制造成本","明细科目":"单套零星支出成本","目标值":null,"合计":0.099360819685106},{"2302":0.946571774262888,"2303":0.600290167319051,"2304":0.586339232132255,"2305":0.418407212620755,"成本类别":"生产制造成本","明细科目":"生产制造成本总计","目标值":0.4,"合计":0.579672329822113},{"2302":3.72073156286697,"2303":2.59076441251647,"2304":2.42011258745031,"2305":2.03452919650274,"成本类别":"变动成本合计","明细科目":"变动成本合计","目标值":1.9,"合计":2.49682545775124},{"2302":25025,"2303":25025,"2304":25025,"2305":25025,"成本类别":"固定成本","明细科目":"房租","目标值":null,"合计":100100},{"2302":27685.4933333333,"2303":27685.4933333333,"2304":23732.8725,"2305":23732.8725,"成本类别":"固定成本","明细科目":"折旧","目标值":null,"合计":102836.731666667},{"2302":null,"2303":null,"2304":null,"2305":null,"成本类别":"固定成本","明细科目":"待摊","目标值":null,"合计":0},{"2302":52710.4933333333,"2303":52710.4933333333,"2304":48757.8725,"2305":48757.8725,"成本类别":"固定成本","明细科目":"合计","目标值":null,"合计":202936.731666667},{"2302":0.434585933871442,"2303":0.20439772195552,"2304":0.156473331621765,"2305":0.151515602810433,"成本类别":"固定成本","明细科目":"单套成本合计","目标值":null,"合计":0.200416098397126},{"2302":4.15531749673841,"2303":2.79516213447199,"2304":2.57658591907208,"2305":2.18604479931317,"成本类别":"变动成本+固定成本","明细科目":"单套成本总计","目标值":null,"合计":2.69724155614836}],
    }
  },
  methods:{
    arraySpanMethod({ row, column, rowIndex },tableData,fields) {
      const visibleData = tableData
      if (fields.includes(column.property)) {
        const cellValue = row[column.property]
        const prevRow = visibleData[rowIndex - 1]
        let nextRow = visibleData[rowIndex + 1]
        if (prevRow && prevRow[column.property] === cellValue) {
          return { rowspan: 0, colspan: 0 }
        } else {
          let countRowspan = 1
          while (nextRow && nextRow[column.property] === cellValue) {
            nextRow = visibleData[++countRowspan + rowIndex]
          }
          if (countRowspan > 1) {
            return { rowspan: countRowspan, colspan: 1 }
          }
        }
      }

    },
    numberFormatter(row,column,cellValue) {
      return typeof cellValue === 'number' ? cellValue.toFixed(4) : cellValue
    }
  }
}
</script>

<style>

</style>

